rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Some One"]]
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = ?  [["director", "Some One"]]
---
  def same_director
    @movie = Movie.find(params[:id])
    director_name = @movie.director

    if not director_name or director_name.empty?
      flash[:notice] = %Q{'#{@movie.title}' has no director info}
      redirect_to root_path
    else
      @movies = Movie.where(:director => director_name).all
      flash[:notice] = %Q{There are #{@movies.size} movie(s) with "#{director_name}" as director}